Revit 2022 API
MassEnergyAnalyticalModel Class
 This class associates a mass instance with an energy analytical model data and geometry.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2012
Syntax
C#
public class MassEnergyAnalyticalModel : Element
Visual Basic
Public Class MassEnergyAnalyticalModel _
	Inherits Element
Visual C++
public ref class MassEnergyAnalyticalModel : public Element
Remarks
 The geometry begins as a copy of its associated mass instance geometry and is modified according to the requirements of the energy analytical model. MassZones are created from the MassEnergyAnalyticalModel and MassLevelDatas associated with a common mass instance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel
See Also
MassEnergyAnalyticalModel Members
Autodesk.Revit.DB.Analysis Namespace